DataProcessors/УведомлениеЗамерщиковОЗамерах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>УведомлениеЗамерщиковОЗамерах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВсем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтКого</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Письма</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кому</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлектронноеПисьмо</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусОтправки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Замеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Замеры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Замер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_Невыходы</v8:Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_Замер</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗамерВыполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийЗамерщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтсутствиеИсполнителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыЗамера</v8:Type>
						<v8:Type>cfg:CatalogRef.РезультатЗамераЛида</v8:Type>
						<v8:Type>cfg:CatalogRef.РезультатыВыездаЛида</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказаЗамера</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Геометка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЭтоВыезд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНазначенияЗамера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументЗамер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗамера</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначилЗамер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначилЗамерПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЭлектронноеПисьмо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЭлектронноеПисьмо</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IDПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Входящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Email</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/УведомлениеЗамерщиковОЗамерах/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.Период.ДатаНачала = ТекущаяДата();
	Объект.Период.ДатаОкончания = ТекущаяДата();
	ПериодПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправлятьВсемПриИзменении(Элемент)
	Элементы.Замерщики.Доступность = НЕ Объект.ОтправлятьВсем;
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ШаблонЗаголовка = "Замеры на %1 - %2";
	Если НачалоДня(Объект.Период.ДатаНачала) = НачалоДня(Объект.Период.ДатаОкончания) Тогда
		ШаблонЗаголовка = "Замеры на %1";	
	КонецЕсли;
	Объект.ЗаголовокПисьма = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаголовка, 
	                                                    	Формат(Объект.Период.ДатаНачала, "ДЛФ=D"),
															Формат(Объект.Период.ДатаОкончания, "ДЛФ=D"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗамерщикиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("МассивЗамерщиков", Замерщики.ВыгрузитьЗначения());
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	
	ОповещениеОЗакрытииПодбора = Новый ОписаниеОповещения("ФормаПодбораПослеЗакрытия", ЭтаФорма, ДополнительныеПараметры);
	ОткрытьФорму("Обработка.УведомлениеЗамерщиковОЗамерах.Форма.ФормаПодбораЗамерщиков", ПараметрыОткрытия, Элемент,,,, ОповещениеОЗакрытииПодбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаПодбораПослеЗакрытия(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеПараметры.Свойство("Элемент") Тогда		
		Возврат;		
	КонецЕсли;
	
	Если ДополнительныеПараметры.Элемент = Элементы.Замерщики Тогда	
		Замерщики.ЗагрузитьЗначения(Результат);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьПисьма(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ОтКого) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле ""От кого""", , "Объект.ОтКого");
		Возврат	;
	КонецЕсли;
	
	Если Объект.Письма.Количество() > 0 Тогда
		ТекстВопроса = "Табличная часть не пуста. Очистить?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ПодготовитьПисьмаЗавершение", ЭтаФорма), ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ПодготовитьПисьмаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьПисьмаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Письма.Очистить();
	КонецЕсли;
		
	ПодготовитьПисьмаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьПисьмаНаСервере()
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("НачалоПериода", 	НачалоДня(Объект.Период.ДатаНачала));
	ДопПараметры.Вставить("КонецПериода",  	КонецДня(Объект.Период.ДатаОкончания));

	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("НачалоПериода", 		НачалоДня(Объект.Период.ДатаНачала));
	Запрос.УстановитьПараметр("КонецПериода",  		КонецДня(Объект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ОтборПоЗамерщикам", 	НЕ Объект.ОтправлятьВсем);
	Запрос.УстановитьПараметр("МассивСотрудников", 	Замерщики.ВыгрузитьЗначения());

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Замеры.ДокументЗамер.Дата КАК ДатаДокумента,
	|	Замеры.ДокументЗамер.Номер КАК НомерДокумента,
	|	Замеры.Дата КАК ДатаЗамера,
	|	Замеры.ВремяНачала КАК ВремяНачала,
	|	Замеры.ВремяОкончания КАК ВремяОкончания,
	|	Замеры.Сотрудник КАК Сотрудник,
	|	Замеры.Адрес КАК Адрес,
	|	Замеры.Комментарий КАК КомментарийКЗамеру,
	|	Замеры.ДокументЗамер.Комментарий КАК Комментарий,
	|	Замеры.ИмяКлиента КАК ИмяКлиента,
	|	Замеры.ТелефонКлиента КАК ТелефонКлиента,
	|	Замеры.ДокументЗамер.Телефоны КАК Телефоны,
	|	Замеры.ДокументЗамер.АдресаЭлектроннойПочты КАК АдресаЭлектроннойПочты
	|ИЗ
	|	РегистрСведений.Замеры КАК Замеры
	|ГДЕ
	|	Замеры.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Замеры.Результат.Ссылка ЕСТЬ NULL
	|	И ВЫБОР
	|			КОГДА &ОтборПоЗамерщикам
	|				ТОГДА Замеры.Сотрудник В (&МассивСотрудников)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ Замеры.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Замеры.Дата,
	|	ВремяНачала
	|ИТОГИ ПО
	|	Сотрудник";
	
	ВыборкаПоСотрудникам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоСотрудникам.Следующий() Цикл
		
		АдресПолучателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаПоСотрудникам.Сотрудник, Справочники.ВидыКонтактнойИнформации.ТелефонСотрудника);
		Если ПустаяСтрока(АдресПолучателя) Тогда
			Продолжить;
		КонецЕсли;
		ТекстHTML = СформироватьТекстHTMLПисьма(ВыборкаПоСотрудникам, ДопПараметры);			
		ПисьмоСсылка = РаботаСЭлектроннойПочтой.СформироватьЭлектронноеПисьмо(Объект.ЗаголовокПисьма, , , , АдресПолучателя, ТекстHTML, Объект.ОтКого);
		
		НоваяСтрока = Объект.Письма.Добавить();
		НоваяСтрока.ЭлектронноеПисьмо = ПисьмоСсылка;
		НоваяСтрока.Сотрудник = ВыборкаПоСотрудникам.Сотрудник;
		НоваяСтрока.Кому = АдресПолучателя;
		НоваяСтрока.Пометка = НЕ ПустаяСтрока(НоваяСтрока.Кому);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция СформироватьТекстHTMLПисьма(ВыборкаПоСотрудникам, ДопПараметры)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_УведомлениеЗамерщиковОЗамерах");
	ТабличныйДокумент = Новый ТабличныйДокумент;
		
	Попытка
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.Заполнить(ДопПараметры);
		ОбластьМакета.Параметры.Заполнить(ВыборкаПоСотрудникам);
		ТабличныйДокумент.Вывести(ОбластьМакета);
	Исключение
	КонецПопытки;
	
	Выборка = ВыборкаПоСотрудникам.Выбрать();
	НомерСтроки = 1 ;
	Пока Выборка.Следующий() Цикл
		ДопПараметры.Вставить("НомерСтроки", НомерСтроки);
		Попытка
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаЗамера");
			ОбластьМакета.Параметры.Заполнить(ДопПараметры);
			ОбластьМакета.Параметры.Заполнить(ВыборкаПоСотрудникам);
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Вывести(ОбластьМакета);
		Исключение
		КонецПопытки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Попытка
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.Заполнить(ДопПараметры);
		ОбластьМакета.Параметры.Заполнить(ВыборкаПоСотрудникам);
		ТабличныйДокумент.Вывести(ОбластьМакета);
	Исключение
	КонецПопытки;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML5);
	ТекстПисьма = Новый ТекстовыйДокумент;
    ТекстПисьма.Прочитать(ИмяВременногоФайла);        
    ТекстХТМЛ = ТекстПисьма.ПолучитьТекст();
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	// преобразовать картинки
	НачальнаяПозицияПоиска = 1;    
    Для Каждого РисунокТабличногоДокумента Из ТабличныйДокумент.Рисунки Цикл     
        Картинка = РисунокТабличногоДокумента.Картинка;
        Если Картинка.Формат() <> ФорматКартинки.PNG Тогда
            Картинка = Картинка.Преобразовать(ФорматКартинки.PNG);
        КонецЕсли;        
        ДвоичныеДанныеКартинки = Картинка.ПолучитьДвоичныеДанные();
        ДвоичныеДанныеКартинкиКакСтрока = Base64Строка(ДвоичныеДанныеКартинки);
    
        Тег_IMG = "<IMG ";
        ПозицияОткрытияТега = СтрНайти(ТекстХТМЛ, Тег_IMG,, НачальнаяПозицияПоиска);
        Если ПозицияОткрытияТега<>0 Тогда
            
            НачальнаяПозицияПоиска = ПозицияОткрытияТега+1;
            
            ПозицияКавычки_НачалоАдреса = СтрНайти(ТекстХТМЛ, """", , ПозицияОткрытияТега);
            Если ПозицияКавычки_НачалоАдреса <> 0 Тогда
                ПозицияКавычки_ОкончаниеАдреса = СтрНайти(ТекстХТМЛ, """", , ПозицияКавычки_НачалоАдреса+1);
                Если ПозицияКавычки_ОкончаниеАдреса<>0 Тогда
                    
                    НовыйАдрес = "data:image/png;base64,"+ДвоичныеДанныеКартинкиКакСтрока;
                        
                    ТекстХТМЛ = Лев(ТекстХТМЛ, ПозицияКавычки_НачалоАдреса)
                        + НовыйАдрес
                        + Сред(ТекстХТМЛ, ПозицияКавычки_ОкончаниеАдреса);
                        
                КонецЕсли;
            КонецЕсли;            
        КонецЕсли;         
    КонецЦикла;
	
	Возврат ТекстХТМЛ;
	
КонецФункции

&НаКлиенте
Процедура Отправить(Команда)
	
	ТекстВопроса = "Подтверждаете отправку писем?";
	ПоказатьВопрос(Новый ОписаниеОповещения("ОтправитьЗавершение", ЭтаФорма), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = КодВозвратаДиалога.Да Тогда 	
		ОтправитьНаСервере(); 	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	
	Для каждого СтрокаПисьма из Объект.Письма Цикл
		Если НЕ СтрокаПисьма.Пометка Тогда
			Продолжить;
		КонецЕсли;
		СтатусОтправки = Документы.ЭлектронноеПисьмо.ОтправитьЭлектронноеПисьмо(СтрокаПисьма.ЭлектронноеПисьмо);
		СтрокаПисьма.Пометка = НЕ ПустаяСтрока(СтатусОтправки);
		СтрокаПисьма.СтатусОтправки = ?(ПустаяСтрока(СтатусОтправки), "Отправлено", СтатусОтправки);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	Для каждого СтрокаПисьма из Объект.Письма Цикл
		СтрокаПисьма.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	Для каждого СтрокаПисьма из Объект.Письма Цикл
		СтрокаПисьма.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры
